Config/Catalogs/РешенияКомиссииПоАктуИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РешенияКомиссииПоАктуИнвентаризации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедакцияДокументаПоНПА</Name>
					<Comment>0 - приказ 157н (2022); 1 - приказ 144н (2024)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Применение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерРаздела</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриложения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/РешенияКомиссииПоАктуИнвентаризации/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Справочники.РешенияКомиссииПоАктуИнвентаризации.ИнициализироватьКэшНомераПриложений(ЭтотОбъект);
	
	Справочники.РешенияКомиссииПоАктуИнвентаризации.ЗаполнитьСписокВыбораРедакцияДокументаПоНПА(Элементы.ОтборРедакцияДокументаПоНПА, Истина);
	
	Справочники.РешенияКомиссииПоАктуИнвентаризации.ДобавитьУсловноеОформлениеКолонкиРедакцияДокументаПоНПАНаФормеСписка(ЭтотОбъект);
	
	Если Параметры.Отбор.Свойство("РедакцияДокументаПоНПА") Тогда
		ОтборРедакцияДокументаПоНПА = Параметры.Отбор.РедакцияДокументаПоНПА;
		
		Элементы.ОтборРедакцияДокументаПоНПА.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОтборРедакцияДокументаПоНПА = -1; // Значение по умолчанию, до изменения пользователем.
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьСписокВыбораНомераПриложения();
	
	НастроитьДоступностьНомераПриложения();
	
	УстановитьОтборПоНомеруПриложения();
	
	УстановитьОтборПоРедакцииДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборНомерРазделаПриИзменении(Элемент)
	
	ОтборНомерПриложения = 0;
	
	НастроитьСписокВыбораНомераПриложения();
	
	НастроитьДоступностьНомераПриложения();
	
	УстановитьОтборПоНомеруПриложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерПриложенияПриИзменении(Элемент)
	
	УстановитьОтборПоНомеруПриложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРедакцияДокументаПоНПАПриИзменении(Элемент)
	
	Если ОчиститьНесовместимоеЗначениеНомераПриложения() Тогда
		УстановитьОтборПоНомеруПриложения();
	КонецЕсли;
	
	НастроитьСписокВыбораНомераПриложения();
	
	НастроитьДоступностьНомераПриложения();
	
	УстановитьОтборПоРедакцииДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРедакцияДокументаПоНПАОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборРедакцияДокументаПоНПА = -1;
	
	ОтборРедакцияДокументаПоНПАПриИзменении(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЭлементыПоПриказу144н(Команда)
	
	ПодтвердитьИСоздатьЭлементыПоПриказу144н();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(ОтборНомерРаздела) И ЗначениеЗаполнено(ОтборНомерПриложения) Тогда
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("НомерРаздела", ОтборНомерРаздела);
		ПараметрыФормы.Вставить("НомерПриложения", ОтборНомерПриложения);
		ПараметрыФормы.Вставить("РедакцияДокументаПоНПА", ОтборРедакцияДокументаПоНПА);
		
		ОткрытьФорму("Справочник.РешенияКомиссииПоАктуИнвентаризации.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ЗаполнитьПредставленияНомеровПриложений(СтрокаСписка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборПоНомеруПриложения()
	
	ИспользованиеОтбора = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОтборНомерРаздела", ОтборНомерРаздела, ИспользованиеОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОтборНомерПриложения", ОтборНомерПриложения, ИспользованиеОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоРедакцииДокумента()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "РедакцияДокументаПоНПА",
		ОтборРедакцияДокументаПоНПА,,, НеобходимОтборПоРедакцииДокумента(ОтборРедакцияДокументаПоНПА));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НеобходимОтборПоРедакцииДокумента(ОтборРедакцияДокументаПоНПА)
	
	Возврат ОтборРедакцияДокументаПоНПА >= 0;
	
КонецФункции

&НаКлиенте
Функция ОчиститьНесовместимоеЗначениеНомераПриложения()
	
	НеобходимоОчистить = Истина;
	
	Если ЗначениеЗаполнено(ОтборНомерРаздела)
		И НеобходимОтборПоРедакцииДокумента(ОтборРедакцияДокументаПоНПА) Тогда
		КлючПриказа = ПолучитьКлючПриказа(ОтборРедакцияДокументаПоНПА);
		
		НомераПриложений = КэшНомераПриложений[КлючПриказа][СтрШаблон("Раздел%1", ОтборНомерРаздела)];
		
		Элемент = НомераПриложений.НайтиПоЗначению(ОтборНомерПриложения);
		
		НеобходимоОчистить = (Элемент = Неопределено);
	КонецЕсли;
	
	Если НеобходимоОчистить Тогда
		ОтборНомерПриложения = Неопределено;
	КонецЕсли;
	
	Возврат НеобходимоОчистить;
	
КонецФункции

&НаКлиенте
Процедура НастроитьСписокВыбораНомераПриложения()
	
	СписокВыбора = Элементы.ОтборНомерПриложения.СписокВыбора;
	
	СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(ОтборНомерРаздела)
		Или Не НеобходимОтборПоРедакцииДокумента(ОтборРедакцияДокументаПоНПА) Тогда
		Возврат;
	КонецЕсли;
	
	КлючПриказа = ПолучитьКлючПриказа(ОтборРедакцияДокументаПоНПА);
	
	НомераПриложений = КэшНомераПриложений[КлючПриказа][СтрШаблон("Раздел%1", ОтборНомерРаздела)];
	
	Для Каждого Элемент Из НомераПриложений Цикл
		СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьНомераПриложения()
	
	Элементы.ОтборНомерПриложения.ТолькоПросмотр =
		Не ЗначениеЗаполнено(ОтборНомерРаздела)
		Или Не НеобходимОтборПоРедакцииДокумента(ОтборРедакцияДокументаПоНПА);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПредставленияНомеровПриложений(СтрокаСписка)
	
	НомераПриложенийРаздела2 = Новый Массив();
	НомераПриложенийРаздела3 = Новый Массив();
	
	Для Каждого СтрокаТЧ Из СтрокаСписка.Ключ.Применение Цикл
		НомерРаздела = СтрокаТЧ.НомерРаздела;
		НомерПриложения = СтрокаТЧ.НомерПриложения;
		
		Если НомерРаздела = 2 И ЗначениеЗаполнено(НомерПриложения) Тогда
			НомераПриложенийРаздела2.Добавить(ПолучитьПредставлениеНомераПриложения(НомерПриложения));
		КонецЕсли;
		
		Если НомерРаздела = 3 И ЗначениеЗаполнено(НомерПриложения) Тогда
			НомераПриложенийРаздела3.Добавить(ПолучитьПредставлениеНомераПриложения(НомерПриложения));
		КонецЕсли;
	КонецЦикла;
	
	СтрокаСписка.Значение.Данные.НомераПриложенийРаздела2 = СтрСоединить(НомераПриложенийРаздела2, ", ");
	СтрокаСписка.Значение.Данные.НомераПриложенийРаздела3 = СтрСоединить(НомераПриложенийРаздела3, ", ");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКлючПриказа(РедакцияДокументаПоНПА)
	
	Если РедакцияДокументаПоНПА = 0 Тогда
		Возврат "Приказ157н";
		
	ИначеЕсли РедакцияДокументаПоНПА = 1 Тогда
		Возврат "Приказ144н";
		
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеНомераПриложения(НомерПриложения)
	
	Если НомерПриложения = 111 Тогда
		Возврат "11.1";
		
	ИначеЕсли НомерПриложения = 112 Тогда
		Возврат "11.2";
		
	Иначе
		Возврат Строка(НомерПриложения);
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ПодтвердитьИСоздатьЭлементыПоПриказу144н()
	
	ТекстВопроса = НСтр("ru='На основании уже имеющихся элементов для акта о результатах инвентаризации в редакции приказа Минфина от 7 ноября 2022 г. N 157н
		|будут созданы новые элементы для акта о результатах инвентаризации в редакции приказа Минфина от 30 сентября 2024 г. N 144н.
		|
		|Продолжить и создать новые элементы справочника?'");
	
	Оповещение = Новый ОписаниеОповещения("ПодтвердитьИСоздатьЭлементыПоПриказу144нЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПодтвердитьИСоздатьЭлементыПоПриказу144нЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьЭлементыПоПриказу144нКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлементыПоПриказу144нКлиент()
	
	Перем ТабДокумент;
	
	СоздатьЭлементыПоПриказу144нСервер(ТабДокумент);
	
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыПоПриказу144нСервер(ТабДокумент)
	
	Перем СписокСозданных, ТаблицаДублей;
	
	Справочники.РешенияКомиссииПоАктуИнвентаризации.СоздатьЭлементыПоПриказу144н2024(СписокСозданных, ТаблицаДублей);
	
	ТабДокумент = Справочники.РешенияКомиссииПоАктуИнвентаризации.ОФормитьРезультатСозданияЭлементовПоПриказу144н2024(СписокСозданных, ТаблицаДублей);
	
КонецПроцедуры

#КонецОбласти
